#6)Дана квадратная матрица размером nxn.
# Найти минимальный элемент среди элементов, расположенных ниже главной диагонали, найти максимальный элемент,
# среди элементов расположенных выше побочной диагонали.
# Найденные минимальный и максимальный элементы поменять местами и вывести их индексы.

array = [[input("N = ")], [input("N = ")]]
print(min(array))
print(max(array))
# [['1'], ['4']]
